import math

EPS = 0.000001 #Погрешность вычислений

v0 = 7935 #Начальная тангенциальная составляющая скорости
R = 6371 * 1000 #Радиус Земли
h = 215 * 1000 #Перицентр орбиты
r0 = R + h #Расстояние от спутника до центра Земли
m1 = 83.6 #Масса спутника
m2 = 6 * (10**24) #Масса Земли
G = 6.67 * (10**-11) #Гравитационная постоянная

M = r0 * m1 * v0 #Момент
E = m1 * v0 * v0 / 2 + (M/(2 * m1 * r0 * r0)) - G * (m1 * m2 / r0) #Энергия

# p/r = 1 + e*cos(φ) - уравнение конического сечения (в данном случае эллипса)

p = M * M / (m1 * G * m1 * m2) #Параметр
e = math.sqrt(1 + (2 * E * M * M) / (m1 * (G * m1 * m2)**2)) #Эксцентриситет

a = p / (1 - e * e) #Большая полуось
b = p / math.sqrt(1 - e * e) #Малая полуось

print('Большая полуось: ' + format(a, 'e'))
print('Малая полуось: ' + format(b, 'e'))

print('Момент импульса системы: ' + format(M, 'e'))
print('Полная механическая энергия: ' + format(E, 'e'))

print('Параметр эллипса: ' + format(p, 'e'))
print('Эксцентриситет эллписа: ' + format(e, 'e'))

print('Перигей орбиты: ' + format(p/(1+e)-R, 'e'))
print('Апогей орбиты: ' + format(p/(1-e)-R, 'e'))

print('Период обращения(с): ' + format(2 * m1 * math.pi * a * b / M, 'e'))
print('Период обращения(мин): ' + format(2 * m1 * math.pi * a * b / M / 60, 'e'))


#---------------------------------------------------------------------------------
f = open('output.txt', 'w')
T = 2 * m1 * math.pi * a * b / M #Период обращения

def formula(d, t):
    if t - (math.sqrt( (m1 * a ** 3) / (G * m1 * m2)) * (d - math.sin(d))) > 0:
        return True
    else:
        return False

N = 2
for t_cycle in range(0, int(T)*N*20, 1):
    t = t_cycle * 0.05
    l = 0
    r = 2 * math.pi * N
    while (abs(l - r) > EPS):#Бинарный поиск угла
        mid = (l + r) / 2
        if(formula(mid, t)):
            l = mid
        else:
            r = mid
    res = (a * (1 - e * math.cos(r))) / 1000 - R/1000 #угол найден, вычислить ответ
    res = round(res,6)#Округлить до 6 знаков после запятой
    t = round(t, 6)
    s2 = str(res).replace('.', ',') #в Excel используются запятые для дробной части, а не точки
    s1 = str(t).replace('.', ',')
    f.write("{0} {1}\n".format(s1, s2))
f.close()
#---------------------------------------------------------------------------------
print('OK')
